# 由公众号"小明创客"技术管理
# 明氏技术有限公司
# 技术主编 ：小明


#运算符的优先级
#算术运算->位运算->比较运算->布尔运算->赋值运算
#有（）先算（）内的

'''
所谓运算符的优先级，是指在应用中哪一个运算符先计算，哪一个后计算，与数学的四则运算应遵
循的“先乘除，后加减”是一个道理。
Python的运算符的运算规则是：优先级高的运算先执行，优先级低的运算后执行，同一优先级的
操作按照从左到右的顺序进行。也可以像四则运算那样使用小括号，括号内的运算最先执行。
'''


#由优先级高到优先级低
'''

**                   幂
~ + -                取反，正号，负号
* / % //             算术运算符
+ -                  算术运算符
<< >>                位运算符中的左移右移
&                    位运算符中的按位与
^                    位运算符中的按位异或
|                    位运算符中的按位或
< <= > >= != ==      比较运算符
=                    赋值运算符

'''







